1) /var/www/html/src/ClassMetadataBuilder.php:78    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             }
             $metadata->addProperties(...($this->propertyGuesser)($classOrObject, $metadata));
             $metadata->addMethods(...($this->methodGuesser)($classOrObject, $metadata));
-            $metadata->addFields(...($this->fieldGuesser)($metadata));
+            
             $metadata->addRelations(...($this->relationGuesser)($metadata));
         } catch (\ReflectionException $e) {
             throw new \RuntimeException('An error occurred during class metadata building.', 0, $e);

2) /var/www/html/src/ClassMetadataBuilder.php:80    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $metadata->addProperties(...($this->propertyGuesser)($classOrObject, $metadata));
             $metadata->addMethods(...($this->methodGuesser)($classOrObject, $metadata));
             $metadata->addFields(...($this->fieldGuesser)($metadata));
-            $metadata->addRelations(...($this->relationGuesser)($metadata));
+            
         } catch (\ReflectionException $e) {
             throw new \RuntimeException('An error occurred during class metadata building.', 0, $e);
         }

3) /var/www/html/src/ClassTypeMetadata.php:124    [M] Foreach_

--- Original
+++ New
@@ @@
     }
     public function addFields(FieldMetadataInterface ...$fields) : self
     {
-        foreach ($fields as $field) {
+        foreach (array() as $field) {
             $this->fields[$field->getName()] = $field;
         }
         return $this;

4) /var/www/html/src/ClassTypeMetadata.php:152    [M] Foreach_

--- Original
+++ New
@@ @@
     }
     public function addRelations(RelationMetadataInterface ...$relations) : self
     {
-        foreach ($relations as $relation) {
+        foreach (array() as $relation) {
             $this->relations[$relation->getName()] = $relation;
         }
         return $this;

5) /var/www/html/src/CollectionTypeMetadata.php:20    [M] CastString

--- Original
+++ New
@@ @@
     }
     public function __toString()
     {
-        return sprintf('%s<%s>', (string) $this->type, (string) $this->inner);
+        return sprintf('%s<%s>', $this->type, (string) $this->inner);
     }
     public function getType() : ClassMetadataInterface
     {

6) /var/www/html/src/CollectionTypeMetadata.php:20    [M] CastString

--- Original
+++ New
@@ @@
     }
     public function __toString()
     {
-        return sprintf('%s<%s>', (string) $this->type, (string) $this->inner);
+        return sprintf('%s<%s>', (string) $this->type, $this->inner);
     }
     public function getType() : ClassMetadataInterface
     {

7) /var/www/html/src/FieldGuesser/PublicPropertyFieldGuesser.php:20    [M] Continue_

--- Original
+++ New
@@ @@
         foreach ($class->getProperties() as $property) {
             $types = iterator_to_array($this->filterTypes(...$property->getTypes()));
             if (count($types) <= 0) {
-                continue;
+                break;
             }
             (yield new FieldMetadata($property->getName(), ...array_values($property->getTypes())));
         }

8) /var/www/html/src/FieldGuesser/PublicPropertyFieldGuesser.php:25    [M] UnwrapArrayValues

--- Original
+++ New
@@ @@
             if (count($types) <= 0) {
                 continue;
             }
-            (yield new FieldMetadata($property->getName(), ...array_values($property->getTypes())));
+            (yield new FieldMetadata($property->getName(), ...$property->getTypes()));
         }
     }
     private function filterTypes(TypeMetadataInterface ...$types) : \Generator

9) /var/www/html/src/FieldGuesser/PublicPropertyFieldGuesser.php:36    [M] Continue_

--- Original
+++ New
@@ @@
     {
         foreach ($types as $type) {
             if (!$type instanceof ScalarTypeMetadata && !$type instanceof ArrayTypeMetadata) {
-                continue;
+                break;
             }
             (yield $type);
         }
     }

11) /var/www/html/src/Type.php:71    [M] LogicalOr

--- Original
+++ New
@@ @@
     }
     public static function is(TypeMetadataInterface $expected, TypeMetadataInterface $actual) : bool
     {
-        if (($expected instanceof ClassTypeMetadata || $expected instanceof ClassReferenceMetadata) && ($actual instanceof ClassTypeMetadata || $actual instanceof ClassReferenceMetadata)) {
+        if ($expected instanceof ClassTypeMetadata && $expected instanceof ClassReferenceMetadata && ($actual instanceof ClassTypeMetadata || $actual instanceof ClassReferenceMetadata)) {
             return is_a((string) $expected, (string) $actual);
         }
         if ($expected instanceof ListTypeMetadata && $actual instanceof ListTypeMetadata) {

12) /var/www/html/src/Type.php:71    [M] LogicalAnd

--- Original
+++ New
@@ @@
     }
     public static function is(TypeMetadataInterface $expected, TypeMetadataInterface $actual) : bool
     {
-        if (($expected instanceof ClassTypeMetadata || $expected instanceof ClassReferenceMetadata) && ($actual instanceof ClassTypeMetadata || $actual instanceof ClassReferenceMetadata)) {
+        if ($expected instanceof ClassTypeMetadata || $expected instanceof ClassReferenceMetadata || ($actual instanceof ClassTypeMetadata || $actual instanceof ClassReferenceMetadata)) {
             return is_a((string) $expected, (string) $actual);
         }
         if ($expected instanceof ListTypeMetadata && $actual instanceof ListTypeMetadata) {

13) /var/www/html/src/Type.php:72    [M] LogicalOr

--- Original
+++ New
@@ @@
     }
     public static function is(TypeMetadataInterface $expected, TypeMetadataInterface $actual) : bool
     {
-        if (($expected instanceof ClassTypeMetadata || $expected instanceof ClassReferenceMetadata) && ($actual instanceof ClassTypeMetadata || $actual instanceof ClassReferenceMetadata)) {
+        if (($expected instanceof ClassTypeMetadata || $expected instanceof ClassReferenceMetadata) && ($actual instanceof ClassTypeMetadata && $actual instanceof ClassReferenceMetadata)) {
             return is_a((string) $expected, (string) $actual);
         }
         if ($expected instanceof ListTypeMetadata && $actual instanceof ListTypeMetadata) {

39) /var/www/html/src/TypeGuesser/CompositeTypeGuesser.php:29    [M] LogicalNot

--- Original
+++ New
@@ @@
      */
     public function __invoke(\ReflectionClass $class, \Reflector $reflector) : \Iterator
     {
-        if (!$reflector instanceof \ReflectionProperty && !$reflector instanceof \ReflectionMethod && !$reflector instanceof \ReflectionParameter) {
+        if (!$reflector instanceof \ReflectionProperty && !$reflector instanceof \ReflectionMethod && $reflector instanceof \ReflectionParameter) {
             throw new \InvalidArgumentException('Expected object of type \\ReflectionProperty, \\ReflectionMethod or \\ReflectionParameter.');
         }
         if (($reflector instanceof \ReflectionProperty || $reflector instanceof \ReflectionParameter) && $reflector->getType() !== null) {

40) /var/www/html/src/TypeGuesser/Docblock/DocblockTypeGuesser.php:131    [M] LogicalAnd

--- Original
+++ New
@@ @@
             }
             return new ListTypeMetadata(in_array($iterated, Type::$builtInTypes) ? $this->builtInType($iterated) : $this->classReferenceType($this->detectFQCN($iterated, $class)));
         }
-        if ($isCollection && $iterated !== null) {
+        if ($isCollection || $iterated !== null) {
             if (in_array($type, Type::$iterable)) {
                 if (in_array($iterated, Type::$builtInTypes)) {
                     return new ListTypeMetadata($this->builtInType($iterated));

41) /var/www/html/src/VirtualMultipleRelationMetadata.php:19    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     use VirtualMultipleTrait;
     public function __construct(string $name, ?MethodMetadata $accessor = null, ?MethodMetadata $mutator = null, ?MethodMetadata $adder = null, ?MethodMetadata $remover = null, ?MethodMetadata $walker = null, ?MethodMetadata $counter = null, TypeMetadataInterface ...$types)
     {
-        parent::__construct($name, ...$types);
+        
         $this->accessor = $accessor;
         $this->mutator = $mutator;
         $this->adder = $adder;

1) /var/www/html/src/ArgumentListMetadata.php:22    [M] FunctionCall

--- Original
+++ New
@@ @@
     }
     public function count()
     {
-        return count($this->arguments);
+        count($this->arguments);
+        return null;
     }
 }

2) /var/www/html/src/ClassMetadataBuilder.php:35    [M] CastString

--- Original
+++ New
@@ @@
     }
     public function buildFromReference(ClassReferenceMetadata $class) : ClassTypeMetadata
     {
-        return $this->buildFromFQCN((string) $class);
+        return $this->buildFromFQCN($class);
     }
     public function buildFromFQCN(string $className) : ClassTypeMetadata
     {

3) /var/www/html/src/ClassMetadataBuilder.php:43    [M] Throw_

--- Original
+++ New
@@ @@
         try {
             return $this->build(new \ReflectionClass($className));
         } catch (\ReflectionException $e) {
-            throw new \RuntimeException(strtr('The class %class.name% was not declared. It does either not exist or it does not have been auto-loaded.', ['%class.name%' => $className]), 0, $e);
+            new \RuntimeException(strtr('The class %class.name% was not declared. It does either not exist or it does not have been auto-loaded.', ['%class.name%' => $className]), 0, $e);
         }
     }
     public function buildFromObject(object $object) : ClassTypeMetadata

4) /var/www/html/src/ClassMetadataBuilder.php:46    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         try {
             return $this->build(new \ReflectionClass($className));
         } catch (\ReflectionException $e) {
-            throw new \RuntimeException(strtr('The class %class.name% was not declared. It does either not exist or it does not have been auto-loaded.', ['%class.name%' => $className]), 0, $e);
+            throw new \RuntimeException(strtr('The class %class.name% was not declared. It does either not exist or it does not have been auto-loaded.', []), 0, $e);
         }
     }
     public function buildFromObject(object $object) : ClassTypeMetadata

5) /var/www/html/src/ClassMetadataBuilder.php:50    [M] DecrementInteger

--- Original
+++ New
@@ @@
         try {
             return $this->build(new \ReflectionClass($className));
         } catch (\ReflectionException $e) {
-            throw new \RuntimeException(strtr('The class %class.name% was not declared. It does either not exist or it does not have been auto-loaded.', ['%class.name%' => $className]), 0, $e);
+            throw new \RuntimeException(strtr('The class %class.name% was not declared. It does either not exist or it does not have been auto-loaded.', ['%class.name%' => $className]), -1, $e);
         }
     }
     public function buildFromObject(object $object) : ClassTypeMetadata

6) /var/www/html/src/ClassMetadataBuilder.php:50    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         try {
             return $this->build(new \ReflectionClass($className));
         } catch (\ReflectionException $e) {
-            throw new \RuntimeException(strtr('The class %class.name% was not declared. It does either not exist or it does not have been auto-loaded.', ['%class.name%' => $className]), 0, $e);
+            throw new \RuntimeException(strtr('The class %class.name% was not declared. It does either not exist or it does not have been auto-loaded.', ['%class.name%' => $className]), 1, $e);
         }
     }
     public function buildFromObject(object $object) : ClassTypeMetadata

7) /var/www/html/src/ClassMetadataBuilder.php:69    [M] Plus

--- Original
+++ New
@@ @@
             if (($index = strrpos($fqcn, '\\')) === false) {
                 $metadata = new ClassTypeMetadata($fqcn);
             } else {
-                $metadata = new ClassTypeMetadata(substr($fqcn, $index + 1), substr($fqcn, 0, $index));
+                $metadata = new ClassTypeMetadata(substr($fqcn, $index - 1), substr($fqcn, 0, $index));
             }
             $metadata->addProperties(...($this->propertyGuesser)($classOrObject, $metadata));
             $metadata->addMethods(...($this->methodGuesser)($classOrObject, $metadata));

8) /var/www/html/src/ClassMetadataBuilder.php:69    [M] OneZeroInteger

--- Original
+++ New
@@ @@
             if (($index = strrpos($fqcn, '\\')) === false) {
                 $metadata = new ClassTypeMetadata($fqcn);
             } else {
-                $metadata = new ClassTypeMetadata(substr($fqcn, $index + 1), substr($fqcn, 0, $index));
+                $metadata = new ClassTypeMetadata(substr($fqcn, $index + 0), substr($fqcn, 0, $index));
             }
             $metadata->addProperties(...($this->propertyGuesser)($classOrObject, $metadata));
             $metadata->addMethods(...($this->methodGuesser)($classOrObject, $metadata));

9) /var/www/html/src/ClassMetadataBuilder.php:69    [M] IncrementInteger

--- Original
+++ New
@@ @@
             if (($index = strrpos($fqcn, '\\')) === false) {
                 $metadata = new ClassTypeMetadata($fqcn);
             } else {
-                $metadata = new ClassTypeMetadata(substr($fqcn, $index + 1), substr($fqcn, 0, $index));
+                $metadata = new ClassTypeMetadata(substr($fqcn, $index + 2), substr($fqcn, 0, $index));
             }
             $metadata->addProperties(...($this->propertyGuesser)($classOrObject, $metadata));
             $metadata->addMethods(...($this->methodGuesser)($classOrObject, $metadata));

10) /var/www/html/src/ClassMetadataBuilder.php:70    [M] DecrementInteger

--- Original
+++ New
@@ @@
             if (($index = strrpos($fqcn, '\\')) === false) {
                 $metadata = new ClassTypeMetadata($fqcn);
             } else {
-                $metadata = new ClassTypeMetadata(substr($fqcn, $index + 1), substr($fqcn, 0, $index));
+                $metadata = new ClassTypeMetadata(substr($fqcn, $index + 1), substr($fqcn, -1, $index));
             }
             $metadata->addProperties(...($this->propertyGuesser)($classOrObject, $metadata));
             $metadata->addMethods(...($this->methodGuesser)($classOrObject, $metadata));

11) /var/www/html/src/ClassMetadataBuilder.php:70    [M] OneZeroInteger

--- Original
+++ New
@@ @@
             if (($index = strrpos($fqcn, '\\')) === false) {
                 $metadata = new ClassTypeMetadata($fqcn);
             } else {
-                $metadata = new ClassTypeMetadata(substr($fqcn, $index + 1), substr($fqcn, 0, $index));
+                $metadata = new ClassTypeMetadata(substr($fqcn, $index + 1), substr($fqcn, 1, $index));
             }
             $metadata->addProperties(...($this->propertyGuesser)($classOrObject, $metadata));
             $metadata->addMethods(...($this->methodGuesser)($classOrObject, $metadata));

12) /var/www/html/src/ClassMetadataBuilder.php:82    [M] Throw_

--- Original
+++ New
@@ @@
             $metadata->addFields(...($this->fieldGuesser)($metadata));
             $metadata->addRelations(...($this->relationGuesser)($metadata));
         } catch (\ReflectionException $e) {
-            throw new \RuntimeException('An error occurred during class metadata building.', 0, $e);
+            new \RuntimeException('An error occurred during class metadata building.', 0, $e);
         }
         return $metadata;
     }
 }

13) /var/www/html/src/ClassMetadataBuilder.php:84    [M] OneZeroInteger

--- Original
+++ New
@@ @@
             $metadata->addFields(...($this->fieldGuesser)($metadata));
             $metadata->addRelations(...($this->relationGuesser)($metadata));
         } catch (\ReflectionException $e) {
-            throw new \RuntimeException('An error occurred during class metadata building.', 0, $e);
+            throw new \RuntimeException('An error occurred during class metadata building.', 1, $e);
         }
         return $metadata;
     }
 }

14) /var/www/html/src/ClassMetadataBuilder.php:84    [M] DecrementInteger

--- Original
+++ New
@@ @@
             $metadata->addFields(...($this->fieldGuesser)($metadata));
             $metadata->addRelations(...($this->relationGuesser)($metadata));
         } catch (\ReflectionException $e) {
-            throw new \RuntimeException('An error occurred during class metadata building.', 0, $e);
+            throw new \RuntimeException('An error occurred during class metadata building.', -1, $e);
         }
         return $metadata;
     }
 }

15) /var/www/html/src/ClassTypeMetadata.php:58    [M] Throw_

--- Original
+++ New
@@ @@
     public function getProperty(string $name) : PropertyMetadata
     {
         if (!isset($this->properties[$name])) {
-            throw new \OutOfBoundsException(strtr('There is no property named %property%', ['%property%' => $name]));
+            new \OutOfBoundsException(strtr('There is no property named %property%', ['%property%' => $name]));
         }
         return $this->properties[$name];
     }

16) /var/www/html/src/ClassTypeMetadata.php:58    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function getProperty(string $name) : PropertyMetadata
     {
         if (!isset($this->properties[$name])) {
-            throw new \OutOfBoundsException(strtr('There is no property named %property%', ['%property%' => $name]));
+            throw new \OutOfBoundsException(strtr('There is no property named %property%', []));
         }
         return $this->properties[$name];
     }

17) /var/www/html/src/ClassTypeMetadata.php:86    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function getMethod(string $name) : MethodMetadata
     {
         if (!isset($this->methods[$name])) {
-            throw new \OutOfBoundsException(strtr('There is no method named %method%', ['%method%' => $name]));
+            throw new \OutOfBoundsException(strtr('There is no method named %method%', []));
         }
         return $this->methods[$name];
     }

18) /var/www/html/src/ClassTypeMetadata.php:86    [M] Throw_

--- Original
+++ New
@@ @@
     public function getMethod(string $name) : MethodMetadata
     {
         if (!isset($this->methods[$name])) {
-            throw new \OutOfBoundsException(strtr('There is no method named %method%', ['%method%' => $name]));
+            new \OutOfBoundsException(strtr('There is no method named %method%', ['%method%' => $name]));
         }
         return $this->methods[$name];
     }

19) /var/www/html/src/ClassTypeMetadata.php:111    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return new \ArrayIterator($this->fields);
     }
-    public function getField(string $name) : FieldMetadataInterface
+    protected function getField(string $name) : FieldMetadataInterface
     {
         if (!isset($this->fields[$name])) {
             throw new \OutOfBoundsException(strtr('There is no field named %field%', ['%field%' => $name]));

20) /var/www/html/src/ClassTypeMetadata.php:113    [M] LogicalNot

--- Original
+++ New
@@ @@
     }
     public function getField(string $name) : FieldMetadataInterface
     {
-        if (!isset($this->fields[$name])) {
+        if (isset($this->fields[$name])) {
             throw new \OutOfBoundsException(strtr('There is no field named %field%', ['%field%' => $name]));
         }
         return $this->fields[$name];

21) /var/www/html/src/ClassTypeMetadata.php:114    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function getField(string $name) : FieldMetadataInterface
     {
         if (!isset($this->fields[$name])) {
-            throw new \OutOfBoundsException(strtr('There is no field named %field%', ['%field%' => $name]));
+            throw new \OutOfBoundsException(strtr('There is no field named %field%', []));
         }
         return $this->fields[$name];
     }

22) /var/www/html/src/ClassTypeMetadata.php:114    [M] Throw_

--- Original
+++ New
@@ @@
     public function getField(string $name) : FieldMetadataInterface
     {
         if (!isset($this->fields[$name])) {
-            throw new \OutOfBoundsException(strtr('There is no field named %field%', ['%field%' => $name]));
+            new \OutOfBoundsException(strtr('There is no field named %field%', ['%field%' => $name]));
         }
         return $this->fields[$name];
     }

23) /var/www/html/src/ClassTypeMetadata.php:139    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return new \ArrayIterator($this->relations);
     }
-    public function getRelation(string $name) : RelationMetadataInterface
+    protected function getRelation(string $name) : RelationMetadataInterface
     {
         if (!isset($this->relations[$name])) {
             throw new \OutOfBoundsException(strtr('There is no relation named %relation%', ['%relation%' => $name]));

24) /var/www/html/src/ClassTypeMetadata.php:141    [M] LogicalNot

--- Original
+++ New
@@ @@
     }
     public function getRelation(string $name) : RelationMetadataInterface
     {
-        if (!isset($this->relations[$name])) {
+        if (isset($this->relations[$name])) {
             throw new \OutOfBoundsException(strtr('There is no relation named %relation%', ['%relation%' => $name]));
         }
         return $this->relations[$name];

25) /var/www/html/src/ClassTypeMetadata.php:142    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function getRelation(string $name) : RelationMetadataInterface
     {
         if (!isset($this->relations[$name])) {
-            throw new \OutOfBoundsException(strtr('There is no relation named %relation%', ['%relation%' => $name]));
+            throw new \OutOfBoundsException(strtr('There is no relation named %relation%', []));
         }
         return $this->relations[$name];
     }

26) /var/www/html/src/ClassTypeMetadata.php:142    [M] Throw_

--- Original
+++ New
@@ @@
     public function getRelation(string $name) : RelationMetadataInterface
     {
         if (!isset($this->relations[$name])) {
-            throw new \OutOfBoundsException(strtr('There is no relation named %relation%', ['%relation%' => $name]));
+            new \OutOfBoundsException(strtr('There is no relation named %relation%', ['%relation%' => $name]));
         }
         return $this->relations[$name];
     }

27) /var/www/html/src/FieldGuesser/VirtualFieldGuesser.php:20    [M] Coalesce

--- Original
+++ New
@@ @@
     private $inflector;
     public function __construct(?Inflector $inflector = null)
     {
-        $this->inflector = $inflector ?? (new English\InflectorFactory())();
+        $this->inflector = (new English\InflectorFactory())();
     }
     private function isSingular(string $field) : bool
     {

28) /var/www/html/src/FieldGuesser/VirtualFieldGuesser.php:25    [M] Identical

--- Original
+++ New
@@ @@
     }
     private function isSingular(string $field) : bool
     {
-        return $this->inflector->singularize($field) === $field;
+        return $this->inflector->singularize($field) !== $field;
     }
     public function __invoke(ClassTypeMetadata $class) : \Iterator
     {

29) /var/www/html/src/FieldGuesser/VirtualFieldGuesser.php:32    [M] Foreach_

--- Original
+++ New
@@ @@
     {
         $methodCandidates = [];
         /** @var MethodMetadata $method */
-        foreach ($class->getMethods() as $method) {
+        foreach (array() as $method) {
             if (preg_match('/is(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && Type::isOneOf(new ScalarTypeMetadata('bool'), ...$method->getReturnTypes()) && count($method->getArguments()) === 0) {
                 $fieldName = $this->inflector->camelize($matches['fieldName']);
                 if (!$this->isSingular($fieldName)) {

30) /var/www/html/src/FieldGuesser/VirtualFieldGuesser.php:33    [M] PregMatchMatches

--- Original
+++ New
@@ @@
         $methodCandidates = [];
         /** @var MethodMetadata $method */
         foreach ($class->getMethods() as $method) {
-            if (preg_match('/is(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && Type::isOneOf(new ScalarTypeMetadata('bool'), ...$method->getReturnTypes()) && count($method->getArguments()) === 0) {
+            if ((int) ($matches = array()) && Type::isOneOf(new ScalarTypeMetadata('bool'), ...$method->getReturnTypes()) && count($method->getArguments()) === 0) {
                 $fieldName = $this->inflector->camelize($matches['fieldName']);
                 if (!$this->isSingular($fieldName)) {
                     continue;

31) /var/www/html/src/FieldGuesser/VirtualFieldGuesser.php:33    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $methodCandidates = [];
         /** @var MethodMetadata $method */
         foreach ($class->getMethods() as $method) {
-            if (preg_match('/is(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && Type::isOneOf(new ScalarTypeMetadata('bool'), ...$method->getReturnTypes()) && count($method->getArguments()) === 0) {
+            if ((preg_match('/is(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) || Type::isOneOf(new ScalarTypeMetadata('bool'), ...$method->getReturnTypes())) && count($method->getArguments()) === 0) {
                 $fieldName = $this->inflector->camelize($matches['fieldName']);
                 if (!$this->isSingular($fieldName)) {
                     continue;

32) /var/www/html/src/FieldGuesser/VirtualFieldGuesser.php:33    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $methodCandidates = [];
         /** @var MethodMetadata $method */
         foreach ($class->getMethods() as $method) {
-            if (preg_match('/is(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && Type::isOneOf(new ScalarTypeMetadata('bool'), ...$method->getReturnTypes()) && count($method->getArguments()) === 0) {
+            if (preg_match('/is(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && Type::isOneOf(new ScalarTypeMetadata('bool'), ...$method->getReturnTypes()) || count($method->getArguments()) === 0) {
                 $fieldName = $this->inflector->camelize($matches['fieldName']);
                 if (!$this->isSingular($fieldName)) {
                     continue;

33) /var/www/html/src/FieldGuesser/VirtualFieldGuesser.php:35    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         $methodCandidates = [];
         /** @var MethodMetadata $method */
         foreach ($class->getMethods() as $method) {
-            if (preg_match('/is(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && Type::isOneOf(new ScalarTypeMetadata('bool'), ...$method->getReturnTypes()) && count($method->getArguments()) === 0) {
+            if (preg_match('/is(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && Type::isOneOf(new ScalarTypeMetadata('bool'), ...$method->getReturnTypes()) && count($method->getArguments()) === 1) {
                 $fieldName = $this->inflector->camelize($matches['fieldName']);
                 if (!$this->isSingular($fieldName)) {
                     continue;

34) /var/www/html/src/FieldGuesser/VirtualFieldGuesser.php:35    [M] Identical

--- Original
+++ New
@@ @@
         $methodCandidates = [];
         /** @var MethodMetadata $method */
         foreach ($class->getMethods() as $method) {
-            if (preg_match('/is(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && Type::isOneOf(new ScalarTypeMetadata('bool'), ...$method->getReturnTypes()) && count($method->getArguments()) === 0) {
+            if (preg_match('/is(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && Type::isOneOf(new ScalarTypeMetadata('bool'), ...$method->getReturnTypes()) && count($method->getArguments()) !== 0) {
                 $fieldName = $this->inflector->camelize($matches['fieldName']);
                 if (!$this->isSingular($fieldName)) {
                     continue;

35) /var/www/html/src/FieldGuesser/VirtualFieldGuesser.php:38    [M] LogicalNot

--- Original
+++ New
@@ @@
         foreach ($class->getMethods() as $method) {
             if (preg_match('/is(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && Type::isOneOf(new ScalarTypeMetadata('bool'), ...$method->getReturnTypes()) && count($method->getArguments()) === 0) {
                 $fieldName = $this->inflector->camelize($matches['fieldName']);
-                if (!$this->isSingular($fieldName)) {
+                if ($this->isSingular($fieldName)) {
                     continue;
                 }
                 if (!isset($methodCandidates[$fieldName])) {

36) /var/www/html/src/FieldGuesser/VirtualFieldGuesser.php:39    [M] Continue_

--- Original
+++ New
@@ @@
             if (preg_match('/is(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && Type::isOneOf(new ScalarTypeMetadata('bool'), ...$method->getReturnTypes()) && count($method->getArguments()) === 0) {
                 $fieldName = $this->inflector->camelize($matches['fieldName']);
                 if (!$this->isSingular($fieldName)) {
-                    continue;
+                    break;
                 }
                 if (!isset($methodCandidates[$fieldName])) {
                     $methodCandidates[$fieldName] = [];

37) /var/www/html/src/FieldGuesser/VirtualFieldGuesser.php:41    [M] LogicalNot

--- Original
+++ New
@@ @@
                 if (!$this->isSingular($fieldName)) {
                     continue;
                 }
-                if (!isset($methodCandidates[$fieldName])) {
+                if (isset($methodCandidates[$fieldName])) {
                     $methodCandidates[$fieldName] = [];
                 }
                 $methodCandidates[$fieldName]['is'] = $method;
