38) /var/www/html/src/FieldGuesser/VirtualFieldGuesser.php:46    [M] LogicalAnd

--- Original
+++ New
@@ @@
                 }
                 $methodCandidates[$fieldName]['is'] = $method;
             } else {
-                if (preg_match('/(?<action>set)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && count($method->getArguments()) === 1) {
+                if (preg_match('/(?<action>set)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) || count($method->getArguments()) === 1) {
                     $action = $matches['action'];
                     $fieldName = $this->inflector->camelize($matches['fieldName']);
                     if (!$this->isSingular($fieldName)) {

39) /var/www/html/src/FieldGuesser/VirtualFieldGuesser.php:46    [M] PregMatchMatches

--- Original
+++ New
@@ @@
                 }
                 $methodCandidates[$fieldName]['is'] = $method;
             } else {
-                if (preg_match('/(?<action>set)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && count($method->getArguments()) === 1) {
+                if ((int) ($matches = array()) && count($method->getArguments()) === 1) {
                     $action = $matches['action'];
                     $fieldName = $this->inflector->camelize($matches['fieldName']);
                     if (!$this->isSingular($fieldName)) {

40) /var/www/html/src/FieldGuesser/VirtualFieldGuesser.php:47    [M] IncrementInteger

--- Original
+++ New
@@ @@
                 }
                 $methodCandidates[$fieldName]['is'] = $method;
             } else {
-                if (preg_match('/(?<action>set)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && count($method->getArguments()) === 1) {
+                if (preg_match('/(?<action>set)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && count($method->getArguments()) === 2) {
                     $action = $matches['action'];
                     $fieldName = $this->inflector->camelize($matches['fieldName']);
                     if (!$this->isSingular($fieldName)) {

41) /var/www/html/src/FieldGuesser/VirtualFieldGuesser.php:47    [M] Identical

--- Original
+++ New
@@ @@
                 }
                 $methodCandidates[$fieldName]['is'] = $method;
             } else {
-                if (preg_match('/(?<action>set)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && count($method->getArguments()) === 1) {
+                if (preg_match('/(?<action>set)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && count($method->getArguments()) !== 1) {
                     $action = $matches['action'];
                     $fieldName = $this->inflector->camelize($matches['fieldName']);
                     if (!$this->isSingular($fieldName)) {

42) /var/www/html/src/FieldGuesser/VirtualFieldGuesser.php:47    [M] OneZeroInteger

--- Original
+++ New
@@ @@
                 }
                 $methodCandidates[$fieldName]['is'] = $method;
             } else {
-                if (preg_match('/(?<action>set)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && count($method->getArguments()) === 1) {
+                if (preg_match('/(?<action>set)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && count($method->getArguments()) === 0) {
                     $action = $matches['action'];
                     $fieldName = $this->inflector->camelize($matches['fieldName']);
                     if (!$this->isSingular($fieldName)) {

46) /var/www/html/src/FieldGuesser/VirtualFieldGuesser.php:59    [M] LogicalAnd

--- Original
+++ New
@@ @@
                     }
                     $methodCandidates[$fieldName][$action] = $method;
                 } else {
-                    if (preg_match('/(?<action>unset|remove|get|has)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && count($method->getArguments()) === 0) {
+                    if (preg_match('/(?<action>unset|remove|get|has)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) || count($method->getArguments()) === 0) {
                         $action = $matches['action'];
                         $fieldName = $this->inflector->camelize($matches['fieldName']);
                         if (!$this->isSingular($fieldName)) {

47) /var/www/html/src/FieldGuesser/VirtualFieldGuesser.php:59    [M] PregMatchMatches

--- Original
+++ New
@@ @@
                     }
                     $methodCandidates[$fieldName][$action] = $method;
                 } else {
-                    if (preg_match('/(?<action>unset|remove|get|has)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && count($method->getArguments()) === 0) {
+                    if ((int) ($matches = array()) && count($method->getArguments()) === 0) {
                         $action = $matches['action'];
                         $fieldName = $this->inflector->camelize($matches['fieldName']);
                         if (!$this->isSingular($fieldName)) {

48) /var/www/html/src/FieldGuesser/VirtualFieldGuesser.php:60    [M] Identical

--- Original
+++ New
@@ @@
                     }
                     $methodCandidates[$fieldName][$action] = $method;
                 } else {
-                    if (preg_match('/(?<action>unset|remove|get|has)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && count($method->getArguments()) === 0) {
+                    if (preg_match('/(?<action>unset|remove|get|has)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && count($method->getArguments()) !== 0) {
                         $action = $matches['action'];
                         $fieldName = $this->inflector->camelize($matches['fieldName']);
                         if (!$this->isSingular($fieldName)) {

49) /var/www/html/src/FieldGuesser/VirtualFieldGuesser.php:60    [M] OneZeroInteger

--- Original
+++ New
@@ @@
                     }
                     $methodCandidates[$fieldName][$action] = $method;
                 } else {
-                    if (preg_match('/(?<action>unset|remove|get|has)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && count($method->getArguments()) === 0) {
+                    if (preg_match('/(?<action>unset|remove|get|has)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && count($method->getArguments()) === 1) {
                         $action = $matches['action'];
                         $fieldName = $this->inflector->camelize($matches['fieldName']);
                         if (!$this->isSingular($fieldName)) {

53) /var/www/html/src/FieldGuesser/VirtualFieldGuesser.php:75    [M] Foreach_

--- Original
+++ New
@@ @@
                 }
             }
         }
-        foreach ($methodCandidates as $fieldName => $actions) {
+        foreach (array() as $fieldName => $actions) {
             /** @var MethodMetadata $accessor */
             $accessor = $actions['get'] ?? $actions['is'] ?? null;
             /** @var MethodMetadata $mutator */

54) /var/www/html/src/FieldGuesser/VirtualFieldGuesser.php:77    [M] Coalesce

--- Original
+++ New
@@ @@
         }
         foreach ($methodCandidates as $fieldName => $actions) {
             /** @var MethodMetadata $accessor */
-            $accessor = $actions['get'] ?? $actions['is'] ?? null;
+            $accessor = $actions['is'] ?? null;
             /** @var MethodMetadata $mutator */
             $mutator = $actions['set'] ?? null;
             if (!isset($accessor) && !isset($mutator)) {

55) /var/www/html/src/FieldGuesser/VirtualFieldGuesser.php:77    [M] Coalesce

--- Original
+++ New
@@ @@
         }
         foreach ($methodCandidates as $fieldName => $actions) {
             /** @var MethodMetadata $accessor */
-            $accessor = $actions['get'] ?? $actions['is'] ?? null;
+            $accessor = $actions['get'] ?? null;
             /** @var MethodMetadata $mutator */
             $mutator = $actions['set'] ?? null;
             if (!isset($accessor) && !isset($mutator)) {

56) /var/www/html/src/FieldGuesser/VirtualFieldGuesser.php:79    [M] Coalesce

--- Original
+++ New
@@ @@
             /** @var MethodMetadata $accessor */
             $accessor = $actions['get'] ?? $actions['is'] ?? null;
             /** @var MethodMetadata $mutator */
-            $mutator = $actions['set'] ?? null;
+            $mutator = null;
             if (!isset($accessor) && !isset($mutator)) {
                 continue;
             }

57) /var/www/html/src/FieldGuesser/VirtualFieldGuesser.php:81    [M] LogicalNot

--- Original
+++ New
@@ @@
             $accessor = $actions['get'] ?? $actions['is'] ?? null;
             /** @var MethodMetadata $mutator */
             $mutator = $actions['set'] ?? null;
-            if (!isset($accessor) && !isset($mutator)) {
+            if (!isset($accessor) && isset($mutator)) {
                 continue;
             }
             (yield new VirtualFieldMetadata($fieldName, $accessor, $mutator, $actions['has'] ?? null, $actions['unset'] ?? $actions['remove'] ?? null));

58) /var/www/html/src/FieldGuesser/VirtualFieldGuesser.php:81    [M] LogicalAnd

--- Original
+++ New
@@ @@
             $accessor = $actions['get'] ?? $actions['is'] ?? null;
             /** @var MethodMetadata $mutator */
             $mutator = $actions['set'] ?? null;
-            if (!isset($accessor) && !isset($mutator)) {
+            if (!isset($accessor) || !isset($mutator)) {
                 continue;
             }
             (yield new VirtualFieldMetadata($fieldName, $accessor, $mutator, $actions['has'] ?? null, $actions['unset'] ?? $actions['remove'] ?? null));

59) /var/www/html/src/FieldGuesser/VirtualFieldGuesser.php:81    [M] LogicalNot

--- Original
+++ New
@@ @@
             $accessor = $actions['get'] ?? $actions['is'] ?? null;
             /** @var MethodMetadata $mutator */
             $mutator = $actions['set'] ?? null;
-            if (!isset($accessor) && !isset($mutator)) {
+            if (isset($accessor) && !isset($mutator)) {
                 continue;
             }
             (yield new VirtualFieldMetadata($fieldName, $accessor, $mutator, $actions['has'] ?? null, $actions['unset'] ?? $actions['remove'] ?? null));

60) /var/www/html/src/FieldGuesser/VirtualFieldGuesser.php:82    [M] Continue_

--- Original
+++ New
@@ @@
             /** @var MethodMetadata $mutator */
             $mutator = $actions['set'] ?? null;
             if (!isset($accessor) && !isset($mutator)) {
-                continue;
+                break;
             }
             (yield new VirtualFieldMetadata($fieldName, $accessor, $mutator, $actions['has'] ?? null, $actions['unset'] ?? $actions['remove'] ?? null));
         }
     }

61) /var/www/html/src/FieldGuesser/VirtualFieldGuesser.php:89    [M] Coalesce

--- Original
+++ New
@@ @@
             if (!isset($accessor) && !isset($mutator)) {
                 continue;
             }
-            (yield new VirtualFieldMetadata($fieldName, $accessor, $mutator, $actions['has'] ?? null, $actions['unset'] ?? $actions['remove'] ?? null));
+            (yield new VirtualFieldMetadata($fieldName, $accessor, $mutator, null, $actions['unset'] ?? $actions['remove'] ?? null));
         }
     }
 }

62) /var/www/html/src/FieldGuesser/VirtualFieldGuesser.php:90    [M] Coalesce

--- Original
+++ New
@@ @@
             if (!isset($accessor) && !isset($mutator)) {
                 continue;
             }
-            (yield new VirtualFieldMetadata($fieldName, $accessor, $mutator, $actions['has'] ?? null, $actions['unset'] ?? $actions['remove'] ?? null));
+            (yield new VirtualFieldMetadata($fieldName, $accessor, $mutator, $actions['has'] ?? null, $actions['remove'] ?? null));
         }
     }
 }

63) /var/www/html/src/FieldGuesser/VirtualFieldGuesser.php:90    [M] Coalesce

--- Original
+++ New
@@ @@
             if (!isset($accessor) && !isset($mutator)) {
                 continue;
             }
-            (yield new VirtualFieldMetadata($fieldName, $accessor, $mutator, $actions['has'] ?? null, $actions['unset'] ?? $actions['remove'] ?? null));
+            (yield new VirtualFieldMetadata($fieldName, $accessor, $mutator, $actions['has'] ?? null, $actions['unset'] ?? null));
         }
     }
 }

64) /var/www/html/src/MethodGuesser/ReflectionMethodGuesser.php:30    [M] NewObject

--- Original
+++ New
@@ @@
         yield from array_map(function (\ReflectionMethod $method) use($classOrObject) {
             return new MethodMetadata($method->getName(), new ArgumentListMetadata(...array_map(function (\ReflectionParameter $parameter) use($classOrObject) {
                 if ($parameter->isVariadic()) {
-                    return new VariadicArgumentMetadata($parameter->getName(), ...($this->typeGuesser)($classOrObject, $parameter));
+                    new VariadicArgumentMetadata($parameter->getName(), ...($this->typeGuesser)($classOrObject, $parameter));
+                    return null;
                 }
                 return new ArgumentMetadata($parameter->getName(), ...($this->typeGuesser)($classOrObject, $parameter));
             }, $method->getParameters())), ...($this->typeGuesser)($classOrObject, $method));

65) /var/www/html/src/MethodGuesser/ReflectionMethodGuesser.php:35    [M] NewObject

--- Original
+++ New
@@ @@
                 if ($parameter->isVariadic()) {
                     return new VariadicArgumentMetadata($parameter->getName(), ...($this->typeGuesser)($classOrObject, $parameter));
                 }
-                return new ArgumentMetadata($parameter->getName(), ...($this->typeGuesser)($classOrObject, $parameter));
+                new ArgumentMetadata($parameter->getName(), ...($this->typeGuesser)($classOrObject, $parameter));
+                return null;
             }, $method->getParameters())), ...($this->typeGuesser)($classOrObject, $method));
         }, $classOrObject->getMethods(\ReflectionMethod::IS_PUBLIC));
     }

66) /var/www/html/src/MethodMetadata.php:21    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->arguments = $argumentList;
         $this->returnTypes = $returnTypes;
     }
-    public function getArguments() : ArgumentListMetadata
+    protected function getArguments() : ArgumentListMetadata
     {
         return $this->arguments;
     }

67) /var/www/html/src/RelationGuesser/PublicPropertyMultipleRelationGuesser.php:15    [M] Foreach_

--- Original
+++ New
@@ @@
 {
     public function __invoke(ClassTypeMetadata $class) : \Iterator
     {
-        foreach ($class->getProperties() as $property) {
+        foreach (array() as $property) {
             $types = iterator_to_array($this->filterTypes(...$property->getTypes()));
             if (count($types) <= 0) {
                 continue;

68) /var/www/html/src/RelationGuesser/PublicPropertyMultipleRelationGuesser.php:17    [M] LessThanOrEqualTo

--- Original
+++ New
@@ @@
     {
         foreach ($class->getProperties() as $property) {
             $types = iterator_to_array($this->filterTypes(...$property->getTypes()));
-            if (count($types) <= 0) {
+            if (count($types) < 0) {
                 continue;
             }
             (yield new MultipleRelationMetadata($property->getName(), ...$types));

69) /var/www/html/src/RelationGuesser/PublicPropertyMultipleRelationGuesser.php:17    [M] LessThanOrEqualToNegotiation

--- Original
+++ New
@@ @@
     {
         foreach ($class->getProperties() as $property) {
             $types = iterator_to_array($this->filterTypes(...$property->getTypes()));
-            if (count($types) <= 0) {
+            if (count($types) > 0) {
                 continue;
             }
             (yield new MultipleRelationMetadata($property->getName(), ...$types));

71) /var/www/html/src/RelationGuesser/PublicPropertyMultipleRelationGuesser.php:30    [M] Foreach_

--- Original
+++ New
@@ @@
     }
     private function filterTypes(TypeMetadataInterface ...$types) : \Generator
     {
-        foreach ($types as $type) {
+        foreach (array() as $type) {
             if (!$type instanceof ListTypeMetadata && !$type instanceof CollectionTypeMetadata) {
                 continue;
             }

72) /var/www/html/src/RelationGuesser/PublicPropertyMultipleRelationGuesser.php:31    [M] LogicalNot

--- Original
+++ New
@@ @@
     private function filterTypes(TypeMetadataInterface ...$types) : \Generator
     {
         foreach ($types as $type) {
-            if (!$type instanceof ListTypeMetadata && !$type instanceof CollectionTypeMetadata) {
+            if ($type instanceof ListTypeMetadata && !$type instanceof CollectionTypeMetadata) {
                 continue;
             }
             (yield $type);

73) /var/www/html/src/RelationGuesser/PublicPropertyMultipleRelationGuesser.php:31    [M] LogicalAnd

--- Original
+++ New
@@ @@
     private function filterTypes(TypeMetadataInterface ...$types) : \Generator
     {
         foreach ($types as $type) {
-            if (!$type instanceof ListTypeMetadata && !$type instanceof CollectionTypeMetadata) {
+            if (!$type instanceof ListTypeMetadata || !$type instanceof CollectionTypeMetadata) {
                 continue;
             }
             (yield $type);

74) /var/www/html/src/RelationGuesser/PublicPropertyMultipleRelationGuesser.php:32    [M] LogicalNot

--- Original
+++ New
@@ @@
     private function filterTypes(TypeMetadataInterface ...$types) : \Generator
     {
         foreach ($types as $type) {
-            if (!$type instanceof ListTypeMetadata && !$type instanceof CollectionTypeMetadata) {
+            if (!$type instanceof ListTypeMetadata && $type instanceof CollectionTypeMetadata) {
                 continue;
             }
             (yield $type);

75) /var/www/html/src/RelationGuesser/PublicPropertyMultipleRelationGuesser.php:34    [M] Continue_

--- Original
+++ New
@@ @@
     {
         foreach ($types as $type) {
             if (!$type instanceof ListTypeMetadata && !$type instanceof CollectionTypeMetadata) {
-                continue;
+                break;
             }
             (yield $type);
         }
     }

81) /var/www/html/src/RelationGuesser/PublicPropertyUnaryRelationGuesser.php:30    [M] LogicalNot

--- Original
+++ New
@@ @@
     private function filterTypes(TypeMetadataInterface ...$types) : \Generator
     {
         foreach ($types as $type) {
-            if (!$type instanceof CompositeTypeMetadataInterface) {
+            if ($type instanceof CompositeTypeMetadataInterface) {
                 continue;
             }
             (yield $type);

82) /var/www/html/src/RelationGuesser/PublicPropertyUnaryRelationGuesser.php:31    [M] Continue_

--- Original
+++ New
@@ @@
     {
         foreach ($types as $type) {
             if (!$type instanceof CompositeTypeMetadataInterface) {
-                continue;
+                break;
             }
             (yield $type);
         }
     }

83) /var/www/html/src/RelationGuesser/RelationGuesserChain.php:19    [M] Foreach_

--- Original
+++ New
@@ @@
     }
     public function __invoke(ClassTypeMetadata $class) : \Iterator
     {
-        foreach ($this->inner as $guesser) {
+        foreach (array() as $guesser) {
             yield from $guesser($class);
         }
     }
 }

84) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:26    [M] Identical

--- Original
+++ New
@@ @@
     }
     private function isPlural(string $field) : bool
     {
-        return $this->inflector->pluralize($field) === $field;
+        return $this->inflector->pluralize($field) !== $field;
     }
     private function isSingular(string $field) : bool
     {

87) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:39    [M] PregMatchMatches

--- Original
+++ New
@@ @@
         $methodCandidates = [];
         /** @var MethodMetadata $method */
         foreach ($class->getMethods() as $method) {
-            if (preg_match('/(?<action>set|remove|add|has)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && count($method->getArguments()) === 1) {
+            if ((int) ($matches = array()) && count($method->getArguments()) === 1) {
                 $action = $matches['action'];
                 $relationName = $this->inflector->camelize($matches['relationName']);
                 if (!isset($methodCandidates[$relationName])) {

88) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:39    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $methodCandidates = [];
         /** @var MethodMetadata $method */
         foreach ($class->getMethods() as $method) {
-            if (preg_match('/(?<action>set|remove|add|has)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && count($method->getArguments()) === 1) {
+            if (preg_match('/(?<action>set|remove|add|has)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) || count($method->getArguments()) === 1) {
                 $action = $matches['action'];
                 $relationName = $this->inflector->camelize($matches['relationName']);
                 if (!isset($methodCandidates[$relationName])) {

89) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:40    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $methodCandidates = [];
         /** @var MethodMetadata $method */
         foreach ($class->getMethods() as $method) {
-            if (preg_match('/(?<action>set|remove|add|has)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && count($method->getArguments()) === 1) {
+            if (preg_match('/(?<action>set|remove|add|has)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && count($method->getArguments()) === 2) {
                 $action = $matches['action'];
                 $relationName = $this->inflector->camelize($matches['relationName']);
                 if (!isset($methodCandidates[$relationName])) {

90) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:40    [M] Identical

--- Original
+++ New
@@ @@
         $methodCandidates = [];
         /** @var MethodMetadata $method */
         foreach ($class->getMethods() as $method) {
-            if (preg_match('/(?<action>set|remove|add|has)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && count($method->getArguments()) === 1) {
+            if (preg_match('/(?<action>set|remove|add|has)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && count($method->getArguments()) !== 1) {
                 $action = $matches['action'];
                 $relationName = $this->inflector->camelize($matches['relationName']);
                 if (!isset($methodCandidates[$relationName])) {

91) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:40    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         $methodCandidates = [];
         /** @var MethodMetadata $method */
         foreach ($class->getMethods() as $method) {
-            if (preg_match('/(?<action>set|remove|add|has)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && count($method->getArguments()) === 1) {
+            if (preg_match('/(?<action>set|remove|add|has)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && count($method->getArguments()) === 0) {
                 $action = $matches['action'];
                 $relationName = $this->inflector->camelize($matches['relationName']);
                 if (!isset($methodCandidates[$relationName])) {

92) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:44    [M] LogicalNot

--- Original
+++ New
@@ @@
             if (preg_match('/(?<action>set|remove|add|has)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && count($method->getArguments()) === 1) {
                 $action = $matches['action'];
                 $relationName = $this->inflector->camelize($matches['relationName']);
-                if (!isset($methodCandidates[$relationName])) {
+                if (isset($methodCandidates[$relationName])) {
                     $methodCandidates[$relationName] = [];
                 }
                 $methodCandidates[$relationName][$action] = $method;

93) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:49    [M] LogicalAnd

--- Original
+++ New
@@ @@
                 }
                 $methodCandidates[$relationName][$action] = $method;
             } else {
-                if (preg_match('/(?<action>unset|get)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && count($method->getArguments()) === 0) {
+                if (preg_match('/(?<action>unset|get)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) || count($method->getArguments()) === 0) {
                     $action = $matches['action'];
                     $relationName = $this->inflector->camelize($matches['relationName']);
                     if (!isset($methodCandidates[$relationName])) {

94) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:49    [M] PregMatchMatches

--- Original
+++ New
@@ @@
                 }
                 $methodCandidates[$relationName][$action] = $method;
             } else {
-                if (preg_match('/(?<action>unset|get)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && count($method->getArguments()) === 0) {
+                if ((int) ($matches = array()) && count($method->getArguments()) === 0) {
                     $action = $matches['action'];
                     $relationName = $this->inflector->camelize($matches['relationName']);
                     if (!isset($methodCandidates[$relationName])) {

95) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:50    [M] OneZeroInteger

--- Original
+++ New
@@ @@
                 }
                 $methodCandidates[$relationName][$action] = $method;
             } else {
-                if (preg_match('/(?<action>unset|get)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && count($method->getArguments()) === 0) {
+                if (preg_match('/(?<action>unset|get)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && count($method->getArguments()) === 1) {
                     $action = $matches['action'];
                     $relationName = $this->inflector->camelize($matches['relationName']);
                     if (!isset($methodCandidates[$relationName])) {

96) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:50    [M] Identical

--- Original
+++ New
@@ @@
                 }
                 $methodCandidates[$relationName][$action] = $method;
             } else {
-                if (preg_match('/(?<action>unset|get)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && count($method->getArguments()) === 0) {
+                if (preg_match('/(?<action>unset|get)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && count($method->getArguments()) !== 0) {
                     $action = $matches['action'];
                     $relationName = $this->inflector->camelize($matches['relationName']);
                     if (!isset($methodCandidates[$relationName])) {

98) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:59    [M] LogicalAnd

--- Original
+++ New
@@ @@
                     }
                     $methodCandidates[$relationName][$action] = $method;
                 } else {
-                    if (preg_match('/count(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && Type::isOneOf(new ScalarTypeMetadata('integer'), ...$method->getReturnTypes()) && count($method->getArguments()) === 0) {
+                    if (preg_match('/count(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && Type::isOneOf(new ScalarTypeMetadata('integer'), ...$method->getReturnTypes()) || count($method->getArguments()) === 0) {
                         $relationName = $this->inflector->camelize($matches['relationName']);
                         if (!isset($methodCandidates[$relationName])) {
                             $methodCandidates[$relationName] = [];

99) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:59    [M] LogicalAnd

--- Original
+++ New
@@ @@
                     }
                     $methodCandidates[$relationName][$action] = $method;
                 } else {
-                    if (preg_match('/count(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && Type::isOneOf(new ScalarTypeMetadata('integer'), ...$method->getReturnTypes()) && count($method->getArguments()) === 0) {
+                    if ((preg_match('/count(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) || Type::isOneOf(new ScalarTypeMetadata('integer'), ...$method->getReturnTypes())) && count($method->getArguments()) === 0) {
                         $relationName = $this->inflector->camelize($matches['relationName']);
                         if (!isset($methodCandidates[$relationName])) {
                             $methodCandidates[$relationName] = [];
