100) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:59    [M] PregMatchMatches

--- Original
+++ New
@@ @@
                     }
                     $methodCandidates[$relationName][$action] = $method;
                 } else {
-                    if (preg_match('/count(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && Type::isOneOf(new ScalarTypeMetadata('integer'), ...$method->getReturnTypes()) && count($method->getArguments()) === 0) {
+                    if ((int) ($matches = array()) && Type::isOneOf(new ScalarTypeMetadata('integer'), ...$method->getReturnTypes()) && count($method->getArguments()) === 0) {
                         $relationName = $this->inflector->camelize($matches['relationName']);
                         if (!isset($methodCandidates[$relationName])) {
                             $methodCandidates[$relationName] = [];

101) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:61    [M] Identical

--- Original
+++ New
@@ @@
                     }
                     $methodCandidates[$relationName][$action] = $method;
                 } else {
-                    if (preg_match('/count(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && Type::isOneOf(new ScalarTypeMetadata('integer'), ...$method->getReturnTypes()) && count($method->getArguments()) === 0) {
+                    if (preg_match('/count(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && Type::isOneOf(new ScalarTypeMetadata('integer'), ...$method->getReturnTypes()) && count($method->getArguments()) !== 0) {
                         $relationName = $this->inflector->camelize($matches['relationName']);
                         if (!isset($methodCandidates[$relationName])) {
                             $methodCandidates[$relationName] = [];

102) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:61    [M] OneZeroInteger

--- Original
+++ New
@@ @@
                     }
                     $methodCandidates[$relationName][$action] = $method;
                 } else {
-                    if (preg_match('/count(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && Type::isOneOf(new ScalarTypeMetadata('integer'), ...$method->getReturnTypes()) && count($method->getArguments()) === 0) {
+                    if (preg_match('/count(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && Type::isOneOf(new ScalarTypeMetadata('integer'), ...$method->getReturnTypes()) && count($method->getArguments()) === 1) {
                         $relationName = $this->inflector->camelize($matches['relationName']);
                         if (!isset($methodCandidates[$relationName])) {
                             $methodCandidates[$relationName] = [];

104) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:69    [M] PregMatchMatches

--- Original
+++ New
@@ @@
                         }
                         $methodCandidates[$relationName]['count'] = $method;
                     } else {
-                        if (preg_match('/walk(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && Type::isOneOf(new ScalarTypeMetadata('iterable'), ...$method->getReturnTypes()) && count($method->getArguments()) === 0) {
+                        if ((int) ($matches = array()) && Type::isOneOf(new ScalarTypeMetadata('iterable'), ...$method->getReturnTypes()) && count($method->getArguments()) === 0) {
                             $relationName = $this->inflector->camelize($matches['relationName']);
                             if (!isset($methodCandidates[$relationName])) {
                                 $methodCandidates[$relationName] = [];

105) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:69    [M] LogicalAnd

--- Original
+++ New
@@ @@
                         }
                         $methodCandidates[$relationName]['count'] = $method;
                     } else {
-                        if (preg_match('/walk(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && Type::isOneOf(new ScalarTypeMetadata('iterable'), ...$method->getReturnTypes()) && count($method->getArguments()) === 0) {
+                        if ((preg_match('/walk(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) || Type::isOneOf(new ScalarTypeMetadata('iterable'), ...$method->getReturnTypes())) && count($method->getArguments()) === 0) {
                             $relationName = $this->inflector->camelize($matches['relationName']);
                             if (!isset($methodCandidates[$relationName])) {
                                 $methodCandidates[$relationName] = [];

106) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:69    [M] LogicalAnd

--- Original
+++ New
@@ @@
                         }
                         $methodCandidates[$relationName]['count'] = $method;
                     } else {
-                        if (preg_match('/walk(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && Type::isOneOf(new ScalarTypeMetadata('iterable'), ...$method->getReturnTypes()) && count($method->getArguments()) === 0) {
+                        if (preg_match('/walk(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && Type::isOneOf(new ScalarTypeMetadata('iterable'), ...$method->getReturnTypes()) || count($method->getArguments()) === 0) {
                             $relationName = $this->inflector->camelize($matches['relationName']);
                             if (!isset($methodCandidates[$relationName])) {
                                 $methodCandidates[$relationName] = [];

107) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:71    [M] OneZeroInteger

--- Original
+++ New
@@ @@
                         }
                         $methodCandidates[$relationName]['count'] = $method;
                     } else {
-                        if (preg_match('/walk(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && Type::isOneOf(new ScalarTypeMetadata('iterable'), ...$method->getReturnTypes()) && count($method->getArguments()) === 0) {
+                        if (preg_match('/walk(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && Type::isOneOf(new ScalarTypeMetadata('iterable'), ...$method->getReturnTypes()) && count($method->getArguments()) === 1) {
                             $relationName = $this->inflector->camelize($matches['relationName']);
                             if (!isset($methodCandidates[$relationName])) {
                                 $methodCandidates[$relationName] = [];

108) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:71    [M] Identical

--- Original
+++ New
@@ @@
                         }
                         $methodCandidates[$relationName]['count'] = $method;
                     } else {
-                        if (preg_match('/walk(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && Type::isOneOf(new ScalarTypeMetadata('iterable'), ...$method->getReturnTypes()) && count($method->getArguments()) === 0) {
+                        if (preg_match('/walk(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->getName(), $matches) && Type::isOneOf(new ScalarTypeMetadata('iterable'), ...$method->getReturnTypes()) && count($method->getArguments()) !== 0) {
                             $relationName = $this->inflector->camelize($matches['relationName']);
                             if (!isset($methodCandidates[$relationName])) {
                                 $methodCandidates[$relationName] = [];

110) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:82    [M] Foreach_

--- Original
+++ New
@@ @@
                 }
             }
         }
-        foreach ($methodCandidates as $relationName => $actions) {
+        foreach (array() as $relationName => $actions) {
             if ($this->isPlural($relationName)) {
                 (yield new VirtualMultipleRelationMetadata($relationName, $actions['get'] ?? null, $actions['set'] ?? null, $actions['add'] ?? null, $actions['remove'] ?? null, $actions['walk'] ?? null, $actions['count'] ?? null));
             }

111) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:86    [M] Coalesce

--- Original
+++ New
@@ @@
         }
         foreach ($methodCandidates as $relationName => $actions) {
             if ($this->isPlural($relationName)) {
-                (yield new VirtualMultipleRelationMetadata($relationName, $actions['get'] ?? null, $actions['set'] ?? null, $actions['add'] ?? null, $actions['remove'] ?? null, $actions['walk'] ?? null, $actions['count'] ?? null));
+                (yield new VirtualMultipleRelationMetadata($relationName, null, $actions['set'] ?? null, $actions['add'] ?? null, $actions['remove'] ?? null, $actions['walk'] ?? null, $actions['count'] ?? null));
             }
             if ($this->isSingular($relationName)) {
                 (yield new VirtualUnaryRelationMetadata($relationName, $actions['get'] ?? $actions['is'] ?? null, $actions['set'] ?? null, $actions['has'] ?? null, $actions['unset'] ?? null));

112) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:87    [M] Coalesce

--- Original
+++ New
@@ @@
         }
         foreach ($methodCandidates as $relationName => $actions) {
             if ($this->isPlural($relationName)) {
-                (yield new VirtualMultipleRelationMetadata($relationName, $actions['get'] ?? null, $actions['set'] ?? null, $actions['add'] ?? null, $actions['remove'] ?? null, $actions['walk'] ?? null, $actions['count'] ?? null));
+                (yield new VirtualMultipleRelationMetadata($relationName, $actions['get'] ?? null, null, $actions['add'] ?? null, $actions['remove'] ?? null, $actions['walk'] ?? null, $actions['count'] ?? null));
             }
             if ($this->isSingular($relationName)) {
                 (yield new VirtualUnaryRelationMetadata($relationName, $actions['get'] ?? $actions['is'] ?? null, $actions['set'] ?? null, $actions['has'] ?? null, $actions['unset'] ?? null));

113) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:88    [M] Coalesce

--- Original
+++ New
@@ @@
         }
         foreach ($methodCandidates as $relationName => $actions) {
             if ($this->isPlural($relationName)) {
-                (yield new VirtualMultipleRelationMetadata($relationName, $actions['get'] ?? null, $actions['set'] ?? null, $actions['add'] ?? null, $actions['remove'] ?? null, $actions['walk'] ?? null, $actions['count'] ?? null));
+                (yield new VirtualMultipleRelationMetadata($relationName, $actions['get'] ?? null, $actions['set'] ?? null, null, $actions['remove'] ?? null, $actions['walk'] ?? null, $actions['count'] ?? null));
             }
             if ($this->isSingular($relationName)) {
                 (yield new VirtualUnaryRelationMetadata($relationName, $actions['get'] ?? $actions['is'] ?? null, $actions['set'] ?? null, $actions['has'] ?? null, $actions['unset'] ?? null));

114) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:89    [M] Coalesce

--- Original
+++ New
@@ @@
         }
         foreach ($methodCandidates as $relationName => $actions) {
             if ($this->isPlural($relationName)) {
-                (yield new VirtualMultipleRelationMetadata($relationName, $actions['get'] ?? null, $actions['set'] ?? null, $actions['add'] ?? null, $actions['remove'] ?? null, $actions['walk'] ?? null, $actions['count'] ?? null));
+                (yield new VirtualMultipleRelationMetadata($relationName, $actions['get'] ?? null, $actions['set'] ?? null, $actions['add'] ?? null, null, $actions['walk'] ?? null, $actions['count'] ?? null));
             }
             if ($this->isSingular($relationName)) {
                 (yield new VirtualUnaryRelationMetadata($relationName, $actions['get'] ?? $actions['is'] ?? null, $actions['set'] ?? null, $actions['has'] ?? null, $actions['unset'] ?? null));

115) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:90    [M] Coalesce

--- Original
+++ New
@@ @@
         }
         foreach ($methodCandidates as $relationName => $actions) {
             if ($this->isPlural($relationName)) {
-                (yield new VirtualMultipleRelationMetadata($relationName, $actions['get'] ?? null, $actions['set'] ?? null, $actions['add'] ?? null, $actions['remove'] ?? null, $actions['walk'] ?? null, $actions['count'] ?? null));
+                (yield new VirtualMultipleRelationMetadata($relationName, $actions['get'] ?? null, $actions['set'] ?? null, $actions['add'] ?? null, $actions['remove'] ?? null, null, $actions['count'] ?? null));
             }
             if ($this->isSingular($relationName)) {
                 (yield new VirtualUnaryRelationMetadata($relationName, $actions['get'] ?? $actions['is'] ?? null, $actions['set'] ?? null, $actions['has'] ?? null, $actions['unset'] ?? null));

116) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:91    [M] Coalesce

--- Original
+++ New
@@ @@
         }
         foreach ($methodCandidates as $relationName => $actions) {
             if ($this->isPlural($relationName)) {
-                (yield new VirtualMultipleRelationMetadata($relationName, $actions['get'] ?? null, $actions['set'] ?? null, $actions['add'] ?? null, $actions['remove'] ?? null, $actions['walk'] ?? null, $actions['count'] ?? null));
+                (yield new VirtualMultipleRelationMetadata($relationName, $actions['get'] ?? null, $actions['set'] ?? null, $actions['add'] ?? null, $actions['remove'] ?? null, $actions['walk'] ?? null, null));
             }
             if ($this->isSingular($relationName)) {
                 (yield new VirtualUnaryRelationMetadata($relationName, $actions['get'] ?? $actions['is'] ?? null, $actions['set'] ?? null, $actions['has'] ?? null, $actions['unset'] ?? null));

117) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:97    [M] Coalesce

--- Original
+++ New
@@ @@
                 (yield new VirtualMultipleRelationMetadata($relationName, $actions['get'] ?? null, $actions['set'] ?? null, $actions['add'] ?? null, $actions['remove'] ?? null, $actions['walk'] ?? null, $actions['count'] ?? null));
             }
             if ($this->isSingular($relationName)) {
-                (yield new VirtualUnaryRelationMetadata($relationName, $actions['get'] ?? $actions['is'] ?? null, $actions['set'] ?? null, $actions['has'] ?? null, $actions['unset'] ?? null));
+                (yield new VirtualUnaryRelationMetadata($relationName, $actions['is'] ?? null, $actions['set'] ?? null, $actions['has'] ?? null, $actions['unset'] ?? null));
             }
         }
     }
 }

118) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:97    [M] Coalesce

--- Original
+++ New
@@ @@
                 (yield new VirtualMultipleRelationMetadata($relationName, $actions['get'] ?? null, $actions['set'] ?? null, $actions['add'] ?? null, $actions['remove'] ?? null, $actions['walk'] ?? null, $actions['count'] ?? null));
             }
             if ($this->isSingular($relationName)) {
-                (yield new VirtualUnaryRelationMetadata($relationName, $actions['get'] ?? $actions['is'] ?? null, $actions['set'] ?? null, $actions['has'] ?? null, $actions['unset'] ?? null));
+                (yield new VirtualUnaryRelationMetadata($relationName, $actions['get'] ?? null, $actions['set'] ?? null, $actions['has'] ?? null, $actions['unset'] ?? null));
             }
         }
     }
 }

119) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:98    [M] Coalesce

--- Original
+++ New
@@ @@
                 (yield new VirtualMultipleRelationMetadata($relationName, $actions['get'] ?? null, $actions['set'] ?? null, $actions['add'] ?? null, $actions['remove'] ?? null, $actions['walk'] ?? null, $actions['count'] ?? null));
             }
             if ($this->isSingular($relationName)) {
-                (yield new VirtualUnaryRelationMetadata($relationName, $actions['get'] ?? $actions['is'] ?? null, $actions['set'] ?? null, $actions['has'] ?? null, $actions['unset'] ?? null));
+                (yield new VirtualUnaryRelationMetadata($relationName, $actions['get'] ?? $actions['is'] ?? null, null, $actions['has'] ?? null, $actions['unset'] ?? null));
             }
         }
     }
 }

120) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:99    [M] Coalesce

--- Original
+++ New
@@ @@
                 (yield new VirtualMultipleRelationMetadata($relationName, $actions['get'] ?? null, $actions['set'] ?? null, $actions['add'] ?? null, $actions['remove'] ?? null, $actions['walk'] ?? null, $actions['count'] ?? null));
             }
             if ($this->isSingular($relationName)) {
-                (yield new VirtualUnaryRelationMetadata($relationName, $actions['get'] ?? $actions['is'] ?? null, $actions['set'] ?? null, $actions['has'] ?? null, $actions['unset'] ?? null));
+                (yield new VirtualUnaryRelationMetadata($relationName, $actions['get'] ?? $actions['is'] ?? null, $actions['set'] ?? null, null, $actions['unset'] ?? null));
             }
         }
     }
 }

121) /var/www/html/src/RelationGuesser/VirtualRelationGuesser.php:100    [M] Coalesce

--- Original
+++ New
@@ @@
                 (yield new VirtualMultipleRelationMetadata($relationName, $actions['get'] ?? null, $actions['set'] ?? null, $actions['add'] ?? null, $actions['remove'] ?? null, $actions['walk'] ?? null, $actions['count'] ?? null));
             }
             if ($this->isSingular($relationName)) {
-                (yield new VirtualUnaryRelationMetadata($relationName, $actions['get'] ?? $actions['is'] ?? null, $actions['set'] ?? null, $actions['has'] ?? null, $actions['unset'] ?? null));
+                (yield new VirtualUnaryRelationMetadata($relationName, $actions['get'] ?? $actions['is'] ?? null, $actions['set'] ?? null, $actions['has'] ?? null, null));
             }
         }
     }
 }

122) /var/www/html/src/Type.php:49    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @return TypeMetadataInterface[]
      */
-    public static function isSubsetOf(iterable $left, iterable $right) : iterable
+    protected static function isSubsetOf(iterable $left, iterable $right) : iterable
     {
         foreach ($left as $type) {
             if (self::isOneOf($type, ...$right)) {

123) /var/www/html/src/Type.php:51    [M] Foreach_

--- Original
+++ New
@@ @@
      */
     public static function isSubsetOf(iterable $left, iterable $right) : iterable
     {
-        foreach ($left as $type) {
+        foreach (array() as $type) {
             if (self::isOneOf($type, ...$right)) {
                 (yield $type);
             }

124) /var/www/html/src/Type.php:58    [M] PublicVisibility

--- Original
+++ New
@@ @@
             }
         }
     }
-    public static function isOneOf(TypeMetadataInterface $expected, TypeMetadataInterface ...$actual) : bool
+    protected static function isOneOf(TypeMetadataInterface $expected, TypeMetadataInterface ...$actual) : bool
     {
         foreach ($actual as $type) {
             if (self::is($expected, $type)) {

125) /var/www/html/src/Type.php:60    [M] Foreach_

--- Original
+++ New
@@ @@
     }
     public static function isOneOf(TypeMetadataInterface $expected, TypeMetadataInterface ...$actual) : bool
     {
-        foreach ($actual as $type) {
+        foreach (array() as $type) {
             if (self::is($expected, $type)) {
                 return true;
             }

126) /var/www/html/src/Type.php:62    [M] TrueValue

--- Original
+++ New
@@ @@
     {
         foreach ($actual as $type) {
             if (self::is($expected, $type)) {
-                return true;
+                return false;
             }
         }
         return false;

128) /var/www/html/src/Type.php:74    [M] CastString

--- Original
+++ New
@@ @@
     public static function is(TypeMetadataInterface $expected, TypeMetadataInterface $actual) : bool
     {
         if (($expected instanceof ClassTypeMetadata || $expected instanceof ClassReferenceMetadata) && ($actual instanceof ClassTypeMetadata || $actual instanceof ClassReferenceMetadata)) {
-            return is_a((string) $expected, (string) $actual);
+            return is_a((string) $expected, $actual);
         }
         if ($expected instanceof ListTypeMetadata && $actual instanceof ListTypeMetadata) {
             return self::is($expected->getInner(), $actual->getInner());

129) /var/www/html/src/Type.php:74    [M] CastString

--- Original
+++ New
@@ @@
     public static function is(TypeMetadataInterface $expected, TypeMetadataInterface $actual) : bool
     {
         if (($expected instanceof ClassTypeMetadata || $expected instanceof ClassReferenceMetadata) && ($actual instanceof ClassTypeMetadata || $actual instanceof ClassReferenceMetadata)) {
-            return is_a((string) $expected, (string) $actual);
+            return is_a($expected, (string) $actual);
         }
         if ($expected instanceof ListTypeMetadata && $actual instanceof ListTypeMetadata) {
             return self::is($expected->getInner(), $actual->getInner());

130) /var/www/html/src/Type.php:80    [M] LogicalAnd

--- Original
+++ New
@@ @@
             return self::is($expected->getInner(), $actual->getInner());
         }
         if ($expected instanceof CollectionTypeMetadata && $actual instanceof CollectionTypeMetadata) {
-            return self::is($expected->getType(), $actual->getType()) && is_a((string) $expected->getInner(), (string) $actual->getInner());
+            return self::is($expected->getType(), $actual->getType()) || is_a((string) $expected->getInner(), (string) $actual->getInner());
         }
         if ($expected instanceof ScalarTypeMetadata && $actual instanceof ScalarTypeMetadata) {

131) /var/www/html/src/Type.php:81    [M] CastString

--- Original
+++ New
@@ @@
             return self::is($expected->getInner(), $actual->getInner());
         }
         if ($expected instanceof CollectionTypeMetadata && $actual instanceof CollectionTypeMetadata) {
-            return self::is($expected->getType(), $actual->getType()) && is_a((string) $expected->getInner(), (string) $actual->getInner());
+            return self::is($expected->getType(), $actual->getType()) && is_a((string) $expected->getInner(), $actual->getInner());
         }
         if ($expected instanceof ScalarTypeMetadata && $actual instanceof ScalarTypeMetadata) {

132) /var/www/html/src/Type.php:81    [M] CastString

--- Original
+++ New
@@ @@
             return self::is($expected->getInner(), $actual->getInner());
         }
         if ($expected instanceof CollectionTypeMetadata && $actual instanceof CollectionTypeMetadata) {
-            return self::is($expected->getType(), $actual->getType()) && is_a((string) $expected->getInner(), (string) $actual->getInner());
+            return self::is($expected->getType(), $actual->getType()) && is_a($expected->getInner(), (string) $actual->getInner());
         }
         if ($expected instanceof ScalarTypeMetadata && $actual instanceof ScalarTypeMetadata) {

133) /var/www/html/src/TypeGuesser/CompositeTypeGuesser.php:31    [M] Throw_

--- Original
+++ New
@@ @@
     public function __invoke(\ReflectionClass $class, \Reflector $reflector) : \Iterator
     {
         if (!$reflector instanceof \ReflectionProperty && !$reflector instanceof \ReflectionMethod && !$reflector instanceof \ReflectionParameter) {
-            throw new \InvalidArgumentException('Expected object of type \\ReflectionProperty, \\ReflectionMethod or \\ReflectionParameter.');
+            new \InvalidArgumentException('Expected object of type \\ReflectionProperty, \\ReflectionMethod or \\ReflectionParameter.');
         }
         if (($reflector instanceof \ReflectionProperty || $reflector instanceof \ReflectionParameter) && $reflector->getType() !== null) {
             yield from ($this->php74Guesser)($class, $reflector->getType());

134) /var/www/html/src/TypeGuesser/Docblock/DocblockTypeGuesser.php:44    [M] Throw_

--- Original
+++ New
@@ @@
     public function __invoke(string $tagName, \ReflectionClass $class, \Reflector $reflector) : \Iterator
     {
         if (!$reflector instanceof \ReflectionProperty && !$reflector instanceof \ReflectionMethod) {
-            throw new \InvalidArgumentException('Expected object of type \\ReflectionProperty, \\ReflectionMethod or \\ReflectionParameter.');
+            new \InvalidArgumentException('Expected object of type \\ReflectionProperty, \\ReflectionMethod or \\ReflectionParameter.');
         }
         if (($comment = $reflector->getDocComment()) === false) {
             return;

135) /var/www/html/src/TypeGuesser/Docblock/DocblockTypeGuesser.php:100    [M] ArrayItem

--- Original
+++ New
@@ @@
         }
         if (($ast = $this->parser->parse($content)) === null) {
-            throw new \RuntimeException(strtr('Could not parse AST of class file %filename%, aborting.', ['%filename%' => $classContext->getFileName()]));
+            throw new \RuntimeException(strtr('Could not parse AST of class file %filename%, aborting.', ['%filename%' > $classContext->getFileName()]));
         }
         $traverser->traverse($ast);
         $context = $nameResolver->getNameContext();

136) /var/www/html/src/TypeGuesser/Docblock/DocblockTypeGuesser.php:100    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         }
         if (($ast = $this->parser->parse($content)) === null) {
-            throw new \RuntimeException(strtr('Could not parse AST of class file %filename%, aborting.', ['%filename%' => $classContext->getFileName()]));
+            throw new \RuntimeException(strtr('Could not parse AST of class file %filename%, aborting.', []));
         }
         $traverser->traverse($ast);
         $context = $nameResolver->getNameContext();

137) /var/www/html/src/TypeGuesser/Docblock/DocblockTypeGuesser.php:100    [M] Throw_

--- Original
+++ New
@@ @@
         }
         if (($ast = $this->parser->parse($content)) === null) {
-            throw new \RuntimeException(strtr('Could not parse AST of class file %filename%, aborting.', ['%filename%' => $classContext->getFileName()]));
+            new \RuntimeException(strtr('Could not parse AST of class file %filename%, aborting.', ['%filename%' => $classContext->getFileName()]));
         }
         $traverser->traverse($ast);
         $context = $nameResolver->getNameContext();

138) /var/www/html/src/TypeGuesser/Docblock/DocblockTypeGuesser.php:134    [M] NewObject

--- Original
+++ New
@@ @@
         if ($isCollection && $iterated !== null) {
             if (in_array($type, Type::$iterable)) {
                 if (in_array($iterated, Type::$builtInTypes)) {
-                    return new ListTypeMetadata($this->builtInType($iterated));
+                    new ListTypeMetadata($this->builtInType($iterated));
+                    return null;
                 }
                 return new ListTypeMetadata($this->classReferenceType($this->detectFQCN($iterated, $class)));
             }

139) /var/www/html/src/TypeGuesser/Docblock/DocblockTypeGuesser.php:139    [M] NewObject

--- Original
+++ New
@@ @@
                 if (in_array($iterated, Type::$builtInTypes)) {
                     return new ListTypeMetadata($this->builtInType($iterated));
                 }
-                return new ListTypeMetadata($this->classReferenceType($this->detectFQCN($iterated, $class)));
+                new ListTypeMetadata($this->classReferenceType($this->detectFQCN($iterated, $class)));
+                return null;
             }
             if (in_array($iterated, Type::$builtInTypes)) {
                 return new CollectionTypeMetadata($this->classReferenceType($type), $this->builtInType($iterated));

140) /var/www/html/src/TypeGuesser/Docblock/DocblockTypeGuesser.php:145    [M] NewObject

--- Original
+++ New
@@ @@
                 return new ListTypeMetadata($this->classReferenceType($this->detectFQCN($iterated, $class)));
             }
             if (in_array($iterated, Type::$builtInTypes)) {
-                return new CollectionTypeMetadata($this->classReferenceType($type), $this->builtInType($iterated));
+                new CollectionTypeMetadata($this->classReferenceType($type), $this->builtInType($iterated));
+                return null;
             }
             return new CollectionTypeMetadata($this->classReferenceType($type), $this->classReferenceType($this->detectFQCN($iterated, $class)));
         }

141) /var/www/html/src/TypeGuesser/Native/Php74TypeGuesser.php:22    [M] Throw_

--- Original
+++ New
@@ @@
             try {
                 $classReflector = new \ReflectionClass($reflector->getName());
                 if ($classReflector->isAnonymous()) {
-                    throw new \RuntimeException('Reached an unexpected anonymous class.');
+                    new \RuntimeException('Reached an unexpected anonymous class.');
                 } else {
                     (yield new ClassReferenceMetadata($classReflector->getShortName(), $classReflector->getNamespaceName()));
                 }
