142) /var/www/html/src/TypeGuesser/Native/Php74TypeGuesser.php:30    [M] Throw_

--- Original
+++ New
@@ @@
                     (yield new ClassReferenceMetadata($classReflector->getShortName(), $classReflector->getNamespaceName()));
                 }
             } catch (\ReflectionException $e) {
-                throw new \RuntimeException(strtr('The class %class.name% was not declared. It does either not exist or it does not have been auto-loaded.', ['%class.name%' => $reflector->getName()]), 0, $e);
+                new \RuntimeException(strtr('The class %class.name% was not declared. It does either not exist or it does not have been auto-loaded.', ['%class.name%' => $reflector->getName()]), 0, $e);
             }
         }
         if ($reflector->allowsNull()) {

143) /var/www/html/src/TypeGuesser/Native/Php74TypeGuesser.php:33    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                     (yield new ClassReferenceMetadata($classReflector->getShortName(), $classReflector->getNamespaceName()));
                 }
             } catch (\ReflectionException $e) {
-                throw new \RuntimeException(strtr('The class %class.name% was not declared. It does either not exist or it does not have been auto-loaded.', ['%class.name%' => $reflector->getName()]), 0, $e);
+                throw new \RuntimeException(strtr('The class %class.name% was not declared. It does either not exist or it does not have been auto-loaded.', []), 0, $e);
             }
         }
         if ($reflector->allowsNull()) {

144) /var/www/html/src/TypeGuesser/Native/Php74TypeGuesser.php:34    [M] ArrayItem

--- Original
+++ New
@@ @@
                     (yield new ClassReferenceMetadata($classReflector->getShortName(), $classReflector->getNamespaceName()));
                 }
             } catch (\ReflectionException $e) {
-                throw new \RuntimeException(strtr('The class %class.name% was not declared. It does either not exist or it does not have been auto-loaded.', ['%class.name%' => $reflector->getName()]), 0, $e);
+                throw new \RuntimeException(strtr('The class %class.name% was not declared. It does either not exist or it does not have been auto-loaded.', ['%class.name%' > $reflector->getName()]), 0, $e);
             }
         }
         if ($reflector->allowsNull()) {

145) /var/www/html/src/TypeGuesser/Native/Php74TypeGuesser.php:37    [M] DecrementInteger

--- Original
+++ New
@@ @@
                     (yield new ClassReferenceMetadata($classReflector->getShortName(), $classReflector->getNamespaceName()));
                 }
             } catch (\ReflectionException $e) {
-                throw new \RuntimeException(strtr('The class %class.name% was not declared. It does either not exist or it does not have been auto-loaded.', ['%class.name%' => $reflector->getName()]), 0, $e);
+                throw new \RuntimeException(strtr('The class %class.name% was not declared. It does either not exist or it does not have been auto-loaded.', ['%class.name%' => $reflector->getName()]), -1, $e);
             }
         }
         if ($reflector->allowsNull()) {

146) /var/www/html/src/TypeGuesser/Native/Php74TypeGuesser.php:37    [M] OneZeroInteger

--- Original
+++ New
@@ @@
                     (yield new ClassReferenceMetadata($classReflector->getShortName(), $classReflector->getNamespaceName()));
                 }
             } catch (\ReflectionException $e) {
-                throw new \RuntimeException(strtr('The class %class.name% was not declared. It does either not exist or it does not have been auto-loaded.', ['%class.name%' => $reflector->getName()]), 0, $e);
+                throw new \RuntimeException(strtr('The class %class.name% was not declared. It does either not exist or it does not have been auto-loaded.', ['%class.name%' => $reflector->getName()]), 1, $e);
             }
         }
         if ($reflector->allowsNull()) {

147) /var/www/html/src/VirtualMultipleTrait.php:20    [M] PublicVisibility

--- Original
+++ New
@@ @@
     private $walker;
     /** @var MethodMetadata */
     private $counter;
-    public function getAccessor() : ?MethodMetadata
+    protected function getAccessor() : ?MethodMetadata
     {
         return $this->accessor;
     }

148) /var/www/html/src/VirtualMultipleTrait.php:25    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->accessor;
     }
-    public function getMutator() : ?MethodMetadata
+    protected function getMutator() : ?MethodMetadata
     {
         return $this->mutator;
     }

149) /var/www/html/src/VirtualMultipleTrait.php:30    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->mutator;
     }
-    public function getAdder() : ?MethodMetadata
+    protected function getAdder() : ?MethodMetadata
     {
         return $this->adder;
     }

150) /var/www/html/src/VirtualMultipleTrait.php:35    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->adder;
     }
-    public function getRemover() : ?MethodMetadata
+    protected function getRemover() : ?MethodMetadata
     {
         return $this->remover;
     }

151) /var/www/html/src/VirtualMultipleTrait.php:40    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->remover;
     }
-    public function getWalker() : ?MethodMetadata
+    protected function getWalker() : ?MethodMetadata
     {
         return $this->walker;
     }

152) /var/www/html/src/VirtualMultipleTrait.php:45    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->walker;
     }
-    public function counter() : ?MethodMetadata
+    protected function counter() : ?MethodMetadata
     {
         return $this->counter;
     }
 }

153) /var/www/html/src/VirtualUnaryRelationMetadata.php:32    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->checker = $checker;
         $this->remover = $remover;
     }
-    public function accessor() : MethodMetadata
+    protected function accessor() : MethodMetadata
     {
         return $this->accessor;
     }

154) /var/www/html/src/VirtualUnaryRelationMetadata.php:37    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->accessor;
     }
-    public function mutator() : MethodMetadata
+    protected function mutator() : MethodMetadata
     {
         return $this->mutator;
     }

155) /var/www/html/src/VirtualUnaryRelationMetadata.php:42    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->mutator;
     }
-    public function checker() : MethodMetadata
+    protected function checker() : MethodMetadata
     {
         return $this->checker;
     }

156) /var/www/html/src/VirtualUnaryRelationMetadata.php:47    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->checker;
     }
-    public function remover() : MethodMetadata
+    protected function remover() : MethodMetadata
     {
         return $this->remover;
     }
 }
